<html>
    <head>
        <title>XeMeLios v5 - Guide Utilisateur</title>
        <meta name="xemelios.version" content="5.0.0.0"/>
        <meta name="date.revision" content="2011-01-31"/>
        <link href="http://xemelios.org/favicon.ico" rel="shortcut icon"/>
        <link rel="stylesheet" type="text/css" href="http://xemelios.org/site/css/main.css"/>
        <!--style type="text/css">
            p.header {
                text-align: center;
                margin: 0 10 5 10;
                font-family: Helvetica;
                font-size: 18px;
                font-weigt: bold;
            }
            p {
                text-align: justify;
                text-justify: auto;
            }
            p.p1 {
                margin-left: 10px;
            }
            h1 {
                font-family: Helvetica;
                font-size: 22px;
                font-weight: bold;
            }</style-->
    </head>
    
    <body class="master">
        <div class="content">
            <a name="top">&#160;</a>
            <h1><a href="http://xemelios.org/index.html"><img src="http://xemelios.org/site/img/xemelios.png" width="487" height="77" alt="X&#233;M&#233;Lios"/></a></h1>
            
            <h1>XeMeLios v5 - Guide Utilisateur</h1>
            <h2>Introduction</h2>
            <p class="p1">L'outil X&eacute;M&eacute;Lios est un outil d'exploitation de donn&eacute;es au format XML, permettant des tris &amp; recherches multicrit&egrave;res, ainsi que la visualisation de fichiers XML. X&eacute;M&eacute;Lios a vocation &agrave; devenir l'outil standard de recherche et de visualisation de toutes les donn&eacute;es qui seront d&eacute;mat&eacute;rialis&eacute;es dans ce format. Dans le cadre des exp&eacute;rimentations actuellement en cours, les donn&eacute;es de la paye mensuelle sont les premi&egrave;res au format XML, les exemples et illustrations de l'utilisation de X&eacute;M&eacute;Lios concernent donc les &eacute;tats de paye. Les sp&eacute;cificit&eacute;s des diff&eacute;rents types de documents exploitables par X&eacute;M&eacute;Lios sont document&eacute;s s&eacute;par&eacute;mment. X&eacute;M&eacute;Lios n'a pas vocation &agrave;
                effectuer des totalisations, calculs ou cumuls de rubriques. Ces fonctions sont assur&eacute;es par les outils bureautiques du poste de travail, la fonction d'export de X&eacute;M&eacute;Lios permet d'envoyer les donn&eacute;es s&eacute;lectionn&eacute;es vers ces outils compl&eacute;mentaires.</p>
            <h2>A propos de ce guide</h2>
            <p class="p1">Ce guide est d&eacute;coup&eacute; en plusieurs parties : la premi&egrave;re concerne la pr&eacute;sentation du site de t&eacute;l&eacute;chargement de X&eacute;M&eacute;Lios et les documents compl&eacute;mentaires. Ensuite, viennent des descriptions des fonctionnalit&eacute;s de base de X&eacute;M&eacute;Lios. Enfin, sont pr&eacute;sent&eacute;es les sp&eacute;cificit&eacute;s de chaque type de documents exploitable par X&eacute;M&eacute;Lios. Pour finir, diverses informations concernant la configuration, la mise &agrave; jour ou l'exploitation de X&eacute;M&eacute;Lios sont expliqu&eacute;es.</p>
            <ol>
                <li>
                    <a href="site_telechargement.html">Pr&eacute;sentation du site de t&eacute;l&eacute;chargement de X&eacute;M&eacute;Lios</a>
                </li>
                <li>
                    <a href="importation_suppression.html">Importations et suppressions de documents</a>
                </li>
                <li>
                    <a href="recherche.html">Recherches</a>
                </li>
                <li>
                    <a href="exports.html">Exports</a>
                </li>
                <li>
                    <a href="controle.html">Analyses de flux</a>
                </li>
                <li>
                    <a href="documents/index.html">Sp&eacute;cificit&eacute; des diff&eacute;rents documents exploitables par X&eacute;M&eacute;Lios</a>
                </li>
                <li>
                    <a href="configs.html">Configuration et environnement de X&eacute;M&eacute;Lios</a>
                </li>
                <li>
                    <a href="maj.html">Mises &agrave; jour de X&eacute;M&eacute;Lios</a>
                </li>
                <li>
                    <a href="exploitation.html">Exploitation</a>
                </li>
            </ol>
            <h2>Contacts</h2>
            <p class="p1">Si vous rencontrez des erreurs dans ce guide ou si vous avez des suggestions &agrave; apporter, merci de prendre contact avec le p&ocirc;le d&eacute;mat&eacute;rialisation : <a href="mailto:helios.demat@dgfip.finances.gouv.fr">helios.demat@dgfip.finances.gouv.fr</a></p>
        </div>
    </body>
</html>
