<html>
    <head>
        <title>Guide utilisateur X&eacute;M&eacute;Lios</title>
        <meta name="xemelios.version" content="3.1.0" />
        <meta name="date.revision" content="2006-11-23" />
        <style type="text/css">
            p.header {
            text-align: center;
            margin: 0 10 5 10;
            font-family: Helvetica;
            font-size: 18px;
            font-weigt: bold;
            
            }
            p {
            text-align: justify;
            text-justify: auto;
            }
            p.p1 {
            margin-left: 10px;
            
            }
            h1 {
            font-family: Helvetica;
            font-size: 22px;
            font-weight: bold;
            
            }</style>
    </head>
    <body>
        <p class="header">
            <img src="images/logo_xemelios.png" alt="Logo Xemelios" />
        </p>
        <p class="header">Mises &agrave; jour de  X&eacute;M&eacute;lios</p>
        <p>Il existe deux mani&egrave;res de mettre &agrave; jour X&eacute;M&eacute;Lios : soit par le site de mise &agrave; jour en ligne, soit par le t&eacute;l&eacute;chargement d'un nouveau programme d'installation.</p>
        <ul>
            <li><a href="#enligne">Mises &agrave; jour en ligne</a></li>
            <li><a href="#setup">Mises &agrave; jour par programme d'installation</a></li>
            <li><a href="#conseils">Recommandations avant toute mise &agrave; jour</a></li>
        </ul>
        <h1><a name="enligne"/>Mises &agrave; jour en ligne</h1>
        <p class="p1">Les mises &agrave; jour en ligne se font depuis Xemelios. On y acc&egrave;de par le menu Fichier / Mises &agrave; jour...<br/>C'est le moyen <b>le plus rapide</b> et <b>le plus s&ucirc;r</b> de profiter des toutes derni&egrave;res mises &agrave; jour de X&eacute;M&eacute;Lios.<br/><br/>
        <img src="images/mnu_maj.png" alt="menu mise a jour"/><br/><br/><br/>
         La boite de mises &agrave; jour s'ouvre et pr&eacute;sente les composants de X&eacute;M&eacute;Lios d&eacute;j&agrave; install&eacute;s :<br/><br/>
            <img src="images/dlg_maj.png" alt="boite maj"/><br/><br/><br/>
         Il faut ensuite aller dans l'onglet Mises &agrave; jour disponibles et cliquer sur Rechercher pour visualiser les mises &agrave; jour disponibles sur le serveur :<br/><br/>
            <img src="images/dlg_maj2.png" alt="maj dispos"/><br/><br/><br/>
            Cliquer ensuite sur Installer pour lancer le t&eacute;l&eacute;chargement des composants.<br/>A l'issue du t&eacute;l&eacute;chargement, X&eacute;M&eacute;Lios avertit qu'il faut relancer X&eacute;M&eacute;Lios.<br/><br/>
            <img src="images/dlg_maj3.png" alt="relancer"/>
        </p>
        <h1><a name="setup"/>Mises &agrave; jour par programme d'installation</h1>
        <p class="p1">La mise &agrave; jour par programme d'installation consiste &agrave; t&eacute;l&eacute;charger une version plus r&eacute;cente du programme d'installation et de proc&eacute;der &agrave; l'installation, comme indiqu&eacute; dans la <a href="http://projets.admisource.gouv.fr/xemelios/doc_install/install_xemelios.html#maj">documentation d'installation</a>. Ce mode de mise &agrave; jour n'est &agrave; utiliser que pour les postes n'ayant pas d'acc&egrave;s &agrave; internet, ou pour les mises &agrave; jour majeures, ou pour les utilisateurs experts.</p>
        <h1><a name="conseils"/>Recommandations avant toute mise &agrave; jour</h1>
        <p class="p1">Dans une installation client/serveur, il est imp&eacute;ratif que tous les postes clients soient install&eacute;s avec la m&ecirc;me version de X&eacute;M&eacute;Lios.<br/>
        Il est fortement recommand&eacute; de commencer par mettre &agrave; jour le poste faisant office de serveur, certaines mises &agrave; n&eacute;cessitant de mettre &agrave; jour la base de donn&eacute;es localement.</p>
    </body>
</html>
