<html>
<body>
<pre>
Xemelios v3.0.0 beta3

____________

Objet de Xemelios

Xemelios est un outil permettant l'exploitation de documents XML : recherche multicrit&egrave;re, tri de r&eacute;sultats, visualisation et export.
Cet outil est disponible sous licence GPL.

Cet Outil s'inscrit pleinement dans le cadre de la Charte Nationale de D&eacute;mat&eacute;rialisation sign&eacute;e en d&eacute;cembre 2004 par les acteurs de la chaine comptable &amp; financi&egrave;res dans le secteur Public Local.

Sa premi&egrave;re application concr&egrave;te concerne la d&eacute;mat&eacute;rialisation des &eacute;tats justificatifs de la Paye, &eacute;tats adress&eacute;s par les ordonnateurs au comptable du Tr&eacute;sor dans le cadre du mandatement de la Paye.
Le sch&eacute;ma XML arr&ecirc;t&eacute; par tous les partenaires est annex&eacute; au pr&eacute;sent outil.

L'outil peut &ecirc;tre &eacute;tendu par param&eacute;trage &agrave; d'autres objets XML. Dans le futur, cet outil permettra notamment de lire et exploiter le compte de gestion sur chiffres d&eacute;mat&eacute;rialis&eacute; par le Tr&eacute;sor Public.

Pour plus de pr&eacute;cisions, <a href="http://www.colloc.minefi.gouv.fr/colo_struct_fina_loca/comp_loca/dema_chai_3.html">http://www.colloc.minefi.gouv.fr/colo_struct_fina_loca/comp_loca/dema_chai_3.html</a>

____________

Nouveaut&eacute;s

2.0.0
- Fonctionnement en base partag&eacute;e. L'import ne se fait qu'une fois sur le poste principal.
- Visualisation des p&eacute;riodes import&eacute;es (les crit&egrave;res ann&eacute;e &amp; mois sont pr&eacute;renseign&eacute;s avec les p&eacute;riodes import&eacute;es)
- Sauvegardes des recherches : les recherches complexes peuvent &ecirc;tre sauvagard&ecirc;es en local du poste client
- Les recherches pr&eacute;d&eacute;finies (comparaison entre mois calculs des entrants et sortants, ou variation des montants en % ou euros)
- L'export de toutes ou partie des lignes des &eacute;tats de paye 
- Suppression s&eacute;lective des mois. Certaines p&eacute;riodes peuvent ainsi &ecirc;tre supprim&eacute;es de la base apr&egrave;s import (suppression des donn&eacute;es qui ne sont plus utilis&eacute;es)
- Affichage de certaines colonnes suppl&eacute;mentaires dans les r&eacute;sultats. Une option "Afficher le champ" peut &ecirc;tre activ&eacute;e apr&eacute;s s&eacute;lection des champs concern&eacute;s (exemple "Heures Suppl&eacute;mentaires").

________

Pr&eacute;requis Techniques

Xemelios n&eacute;cessite l'installation du Java Runtime Environnement 5.0 (JRE 1.5) disponible sur le site java.sun.com
Cette installation est r&eacute;alis&eacute;e automatiquement dans le package complet.


Les Pr&eacute;requis mat&eacute;riels sur le PC d&eacute;pendent fortement de la volum&eacute;trie des donn&eacute;es XML trait&eacute;es et du type d'objet XML.

Pour l'&eacute;tat de Paye particuli&egrave;rement exigeant &eacute;tant donn&eacute; le nombre de donn&eacute;es &agrave; indexer, les pr&eacute;requis estim&eacute;s sont les suivants :


1) POSTE EN MODE AUTONOME OU SERVEUR

Jusqu'&agrave; 5000 Payes annuelles
OS : Windows 98/2000/XP
RAM  minimum : 64 Mo (W98) ou 128 Mo (2000/XP)
RAM conseill&eacute;e : 128 Mo (W98) ou 256 Mo (2000/XP)
Espace disque temporaire : 1 Go
Espace disque permanent : 300 Mo


Jusqu'&agrave; 50 000 Payes annuelles
OS : 2000/XP
RAM  minimum : 256 Mo (2000/XP)
RAM conseill&eacute;e : 512 Mo et > (2000/XP)
Espace disque temporaire : 5 Go
Espace disque permanent : 1 Go


Au dessus de 50 000 Payes annuelles
N&eacute;cessite la mise en place d'un serveur "Base de donn&eacute;es"
Nous consulter : helios.demat@dgfip.finances.gouv.fr


2) POSTE EN MODE CLIENT

OS : Windows 98/2000/XP
RAM  minimum : 64 Mo (W98) ou 128 Mo (2000/XP)
RAM conseill&eacute;e : 128 Mo (W98) ou 256 Mo (2000/XP)
Espace disque permanent : 50 Mo
</pre>
</body>
</html>
