<html>
<head>
    <title>Guide utilisateur X&eacute;M&eacute;Lios</title>
<meta name="xemelios.version" content="3.3.0"/>
<meta name="date.revision" content="2006-11-23"/>
<style type="text/css">
p.header { text-align: center; margin: 0 10 5 10; font-family: Helvetica; font-size: 18px; font-weight: bold; }
p { text-align: justify; text-justify: auto;}
p.p1 { margin-left: 10px; }
.p2 { margin-left: 20px; }
p.p3 { margin-left: 30px; }
p.center { text-align: center; }
h1 { font-family: Helvetica; font-size: 22px; font-weight: bold; }
h2 { margin-left: 10px; font-family: Helvetica; font-size: 18px; font-weight: bold; }
h3 { margin-left: 20px; font-family: Helvetica; font-size: 16px; font-weight: bold; }
table { background-color: black; cell-spacing: 1px; }
td { background-color: white; }
td.center { text-align:center; }
th { background-color: #9F9F9F; text-align: left; }
.under { text-decoration: underline; }
</style>
</head>
<body>
<p class="header"><img src="images/logo_xemelios.png" alt="Logo Xemelios"/></p>
<p class="header">Recherches</p>
<h3 style="margin-left: 0px">Index</h3>
<p><a href="#acces">Acc&egrave;s aux recherches</a><br/>
<a href="#fenetre_recherche">Fen&ecirc;tre de recherche</a><br/>
&nbsp;&nbsp;<a href="#barre_outils">Barre d'outils</a><br/>
&nbsp;&nbsp;<a href="#zone_criteres">Zone de crit&egrave;res</a><br/>
&nbsp;&nbsp;<a href="#zone_resultat">Zone de r&eacute;sultats</a><br/>
</p>
<h1><a name="acces"/>Acc&egrave;s aux recherches</h1>
    <p class="p1">L'acc&egrave;s aux recherches n'est possibles que si des donn&eacute;es ont &eacute;t&eacute; import&eacute;es. Dans le menu Recherche, s&eacute;l&eacute;ctionnez le type de document sur lequel vous voulez effectuer une recherche, puis le type d'&eacute;l&eacute;ment que vous souhaitez rechercher. Le d&eacute;tail  des types de document et des &eacute;l&eacute;ments est disponible dans les <a href="documents/index.html">sp&eacute;cificit&eacute;s des documents</a>.</p><p class="header"><img src="images/menu_recherche.png" alt="menu recherche"/></p>
<h1><a name="fenetre_recherche"/>Fen&ecirc;tre de recherche</h1>
    <p class="p1">Quel que soit l'&eacute;l&eacute;ment recherch&eacute;, la fen&ecirc;tre de recherche est la m&ecirc;me. Elle se compose de la barre de collectivit&eacute;s et de budgets, d'une barre d'outils, d'une liste de crit&egrave;res et d'une zone de r&eacute;sultat.</p><p class="header"><img src="images/boite_recherche.png" alt="fenetre recherche"/></p>
<h2>Barre de collectivit&eacute;s et de budgets</h2>
    <p class="p2">Cette barre contient une premi&egrave;re liste comprenant la liste des collectivit&eacute;s pour lesquelles des donn&eacute;es ont &eacute;t&eacute; import&eacute;es. L'utilisateur doit s&eacute;l&eacute;ctionner la collectivit&eacute; sur laquelle vont porter ses recherches.<br/>
        La liste suivante comporte la liste des budgets de la collectivit&eacute; s&eacute;l&eacute;ctionn&eacute;e pour lesquels des donn&eacute;es ont &eacute;t&eacute; import&eacute;es.</p>
<h2><a name="barre_outils"/>Barre d'outils</h2>
    <p class="p2">La barre d'outils contient l'ensemble des boutons permettant de r&eacute;aliser des actions dans cette fen&ecirc;tre.<br/>
        Les &eacute;l&eacute;ments de la barre d'outils sont d&eacute;taill&eacute;s dans le tableau ci-dessous :</p>
<table class="p2">
    <thead>
        <tr><th>Bouton</th><th>Description</th></tr>
    </thead>
    <tbody>
        <tr><td class="center"><img src="images/btn_plus.png" alt="plus"/></td><td>Permet d'ajouter un crit&egrave;re &agrave; la liste des crit&egrave;res</td></tr>
        <tr><td class="center"><img src="images/btn_search.png" alt="chercher"/></td><td>Permet de lancer la recherche</td></tr>
        <tr><td class="center"><img src="images/btn_search_back.png" alt="chercher arriere plan"/></td><td>Permet de lancer la recherche en t&acirc;che de fond</td></tr>
        <tr><td class="center"><img src="images/btn_erase.png" alt="supprimer"/></td><td>Permet de supprimer tous les crit&egrave;res</td></tr>
        <tr><td class="center"><img src="images/btn_nomencl.png" alt="nomenclature"/></td><td>Permet d'afficher la nomenclature si celle-ci est disponible pour ce type de document</td></tr>
        <tr><td class="center"><img src="images/btn_save.png" alt="enregistrer"/></td><td>Permet d'enregistrer la recherche courante pour la rejouer plus tard</td></tr>
        <tr><td class="center"><img src="images/btn_open-request.png" alt="ouvrir recherche"/></td><td>Permet d'ouvrir une recherche pr&eacute;d&eacute;finie ou une recherche enregistr&eacute;e</td></tr>
        <tr><td class="center"><img src="images/btn_environment.png" alt="environnement"/></td><td>Permet d'acc&eacute;der &agrave; la <a href="configs.html#env">fen&ecirc;netre de modification de l'environnement</a>.</td></tr>
    </tbody>
</table>
<h2><a name="zone_criteres"/>Zone de crit&egrave;res</h2>
    <p class="p2">La zone de crit&egrave;res sert &agrave; construire les filtres &agrave; appliquer &agrave; la recherche. Elle doit contenir au moins un crit&egrave;re. L'utilisateur peut ajouter autant de crit&egrave;res qu'il le d&eacute;sire.</p>
<h3>Choix du crit&egrave;re</h3>
<p class="p3">A l'ouverture de la fen&ecirc;tre de recherche, il y a toujours un crit&egrave;re affich&egrave;.</p><p class="header"><img src="images/detail_critere.png" alt="detail critere"/></p>
    <p class="p3">La premi&egrave;re liste contient tous les crit&egrave;res disponibles. En fonction du crit&egrave;re que choisit l'utilisateur, les champs correspondants s'affichent. Dans l'exemple ci-dessus, le crit&egrave;re porte sur Ann&eacute;e et mois, l'utilisateur peut s&eacute;lectionner l'ann&eacute;e et le mois qu'il veut parmi ceux disponibles.</p>
<h3>Combinaison de deux crit&egrave;res</h3>
    <p class="p3">X&eacute;M&eacute;Lios permet de combiner plusieurs crit&egrave;res afin d'affiner au mieux les recherches. Pour ce faire, il suffit de cliquer sur le bouton <img src="images/btn_plus.png" style="vertical-align: sub;" alt="plus"/> pour ajouter un crit&egrave;re dans la zone de crit&egrave;res. Deux crit&egrave;res peuvent s'appliquer &agrave; une recherche en formant un <strong>ET</strong> ou un <strong>OU</strong>.</p>
    <p class="p3">Un <strong>ET</strong> fait que les &eacute;l&eacute;ments recherch&eacute;s doivent correspondre aux deux crit&egrave;res. Par exemple, une recherche sur les bulletins de paye avec une premier crit&egrave;re "Ann&eacute;e mois" : septembre 2005 <strong>ET</strong> un second crit&egrave;re "Agent (nom)": DUPONT, ram&egrave;nera les bulletins de paye des agents s'appelant DUPONT pour le mois de septembre 2005.</p><p class="header"><img src="images/recherche1.png" alt="recherche"/></p>
    <p class="p3">Un <strong>OU</strong> fait que les &eacute;l&eacute;ments recherch&eacute;s doivent correspondre &agrave; l'une ou l'autre des deux crit&egrave;res. Ainsi, une recherche sur les bulletins de paye avec un premier crit&egrave;re "Montant Net" &gt;= 20000&euro; <strong>OU</strong> un second crit&egrave;re "Montant Net" &lt;= 100&euro; renvoie tous les bulletins dont les montants nets sont inf&eacute;rieurs &agrave; 100&euro; <strong>OU</strong> sup&eacute;rieurs &agrave; 20000&euro;.</p><p class="header"><img src="images/recherche2.png" alt="recherche"/></p>
<h3>Combinaison de plus de 2 crit&egrave;res avec des <span class="under">OU</span></h3>
    <p class="p3">L'action des liens <strong>ET</strong> et <strong>OU</strong> n'est pas la m&ecirc;me vis &agrave; vis de la pr&eacute;c&eacute;dence des op&eacute;rateurs. Ainsi, si on veut r&eacute;aliser une recherche</p>
<p class="center"><tt>condition1 <strong>ET</strong> (condition2 <strong>OU</strong> condition3)</tt></p>
    <p class="p3">il faut r&eacute;p&eacute;ter la <tt>condition1</tt> dans les deux branches du <strong>OU</strong> :</p>
<p class="center"><tt>condition1 <strong>ET</strong> condition 2 <strong>OU</strong> condition1 <strong>ET</strong> condition3</tt></p>
<p class="p3">Par exemple, pour chercher les bulletins de septembre <strong>OU</strong> d'octobre de l'agent DUPONT, il faut effectuer la recherche suivante :</p><p class="header"><img src="images/recherche3.png" alt="recherche"/></p>
    <p class="p3">Ceci est d&ucirc; au fait qu'il n'y a pas de syst&egrave;me de parenth&eacute;sage entre les crit&egrave;res dans X&eacute;M&eacute;Lios.</p>
<h3>Suppression d'un crit&egrave;re</h3>
    <p class="p3">Pour supprimer un crit&egrave;re, il suffit de cliquer sur le bouton de suppression <img src="images/btn_suppr.png" style="vertical-align: sub;" alt="supprimer critere"/> situ&eacute; sur la ligne du crit&egrave;re &agrave; supprimer. Il n'est pas possible de supprimer le premier crit&egrave;re puisqu'il faut avoir au moins un crit&egrave;re pour r&eacute;aliser une recherche.</p>
    <h2><a name="zone_resultat"/>Zone de r&eacute;sultat</h2>
    <p class="p2">La zone de r&eacute;sultat sert &agrave; afficher le r&eacute;sultat de la recherche. Elle comporte un tableau permettant d'afficher les &eacute;l&eacute;ments trouv&eacute;s, et d'un composant permettant de naviguer d'une page de r&eacute;sultat &agrave; l'autre.</p>
    <h3>Personnalisation de l'affichage du r&eacute;sultat de recherche</h3>
    <p class="p3">Il est possible de personnaliser l'affichage du r&eacute;sultat de recherche. A l'aide du bouton <img src="images/btn_perso_affichage.png" style="vertical-align: sub;" alt="personnalisation affichage"/> situ&eacute; en haut &agrave; droite de la zone de r&eacute;sultat, on peut redimmensionner automatiquement les colonnes, masquer ou afficher les colonnes</p><p class="center"><img src="images/menu_personnaliser.png" alt="menu personnalisation"/></p>
    <p class="p3">En agissant sur les ent&ecirc;tes de colonnes, il est possible de trier le contenu du tableau et de d&eacute;placer les colonnes.</p><p class="center"><img src="images/tri_deplacement.png" alt="tri et deplacement"/></p>
    <h3>Pagination des r&eacute;sultats</h3>
    <p class="p3">Lorsque le nombre d'&eacute;l&eacute;ment trouv&eacute; est trop important pour &ecirc;tre affich&eacute; en une seule fois, X&eacute;M&eacute;Lios affiche les r&eacute;sultats par page. Le composant de navigation indique le nombre de pages disponibles en bas &agrave; droite de la fen&ecirc;tre de recherche.</p><p class="center"><img src="images/search_pages.png" alt="pagination"/></p><p class="p3">L'utilisateur peut alors utiliser les diff&eacute;rents boutons pour naviguer de page en page, ou la liste d&eacute;roulante pour acc&eacute;der &agrave; une page en particulier.</p>
 <h3>Visualisation d'un &eacute;l&eacute;ment</h3>
    <p class="p3">Lorsqu'un &eacute;l&eacute;ment est visualisable, on peut l'afficher en double-cliquant sur une ligne du tableau de r&eacute;sultat de recherche. Par exemple, pour les recherche sur les bulletins de paye, en double-cliquant sur une ligne on affiche le bulletin de paye correspondant. Pour certains &eacute;l&eacute;ments, il n'y a pas de visualisation possible, comme par exemple pour les &eacute;tats de r&eacute;partition par nature.</p>
 <h3>Actions sur un &eacute;l&eacute;ment</h3>
    <p class="p3">Certains &eacute;l&eacute;ments proposent des actions dans la liste de r&eacute;sultat de recherche. En faisant un clic-droit sur une ligne du tableau de r&eacute;sultat de recherche, on fait alors appara&icirc;tre les actions disponibles. Par exemple, depuis la paye, il est possible de visualiser tous les bulletins d'un agent, ou d'exporter un rapport d'analyse.</p>
</body>
</html>